# Terraform environment yt01
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_private_dns_zone.key_vault: Reading...
data.azurerm_private_dns_zone.hub_service_bus: Reading...
data.azurerm_virtual_network.hub_vnet: Reading...
data.azurerm_private_dns_zone.key_vault: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net]
data.azurerm_virtual_network.hub_vnet: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/virtualNetworks/vnetaltinnauth001hub]
data.azurerm_private_dns_zone.hub_service_bus: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_application_insights.telemetry will be updated in-place
  ~ resource "azurerm_application_insights" "telemetry" {
        id                                    = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.Insights/components/aialtinnauth001yt01"
        name                                  = "aialtinnauth001yt01"
        tags                                  = {}
        # (16 unchanged attributes hidden)
    }

  # azurerm_log_analytics_workspace.telemetry will be updated in-place
  ~ resource "azurerm_log_analytics_workspace" "telemetry" {
        id                                      = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.OperationalInsights/workspaces/logaltinnauth001yt01"
        name                                    = "logaltinnauth001yt01"
        tags                                    = {}
        # (14 unchanged attributes hidden)
    }

  # azurerm_private_endpoint.key_vault will be created
  + resource "azurerm_private_endpoint" "key_vault" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "nickvaltinnauth001yt01"
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "pepkvaltinnauth001yt01"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "rgaltinnauth001yt01"
      + subnet_id                     = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.Network/virtualNetworks/vnetdsaltinnauth001yt01/subnets/Default"
      + tags                          = {
          + "CreatedAt"   = "2025-01-16T09:21:42Z"
          + "Environment" = "yt01"
          + "Instance"    = "001"
          + "ProductName" = "auth"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "privatelink.vaultcore.azure.net"
          + private_dns_zone_ids = [
              + "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "kvaltinnauth001yt01"
          + private_connection_resource_id = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.KeyVault/vaults/kvaltinnauth001yt01"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

  # azurerm_private_endpoint.service_bus_private_endpoint[0] will be created
  + resource "azurerm_private_endpoint" "service_bus_private_endpoint" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "nicsbsbaltinnaltinnauth001yt01"
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "pesbaltinnaltinnauth001yt01"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "rgaltinnauth001yt01"
      + subnet_id                     = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.Network/virtualNetworks/vnetdsaltinnauth001yt01/subnets/ServiceBus"

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "sbaltinnaltinnauth001yt01"
          + private_dns_zone_ids = [
              + "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "sbaltinnaltinnauth001yt01"
          + private_connection_resource_id = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.ServiceBus/namespaces/sbaltinnaltinnauth001yt01"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "namespace",
            ]
        }
    }

  # azurerm_servicebus_namespace.service_bus will be updated in-place
  ~ resource "azurerm_servicebus_namespace" "service_bus" {
        id                                  = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001yt01/providers/Microsoft.ServiceBus/namespaces/sbaltinnaltinnauth001yt01"
        name                                = "sbaltinnaltinnauth001yt01"
        tags                                = {
            "CreatedAt"   = "2025-01-16T09:21:42Z"
            "Environment" = "yt01"
            "Instance"    = "001"
            "ProductName" = "auth"
        }
        # (13 unchanged attributes hidden)

      ~ network_rule_set {
          ~ public_network_access_enabled = true -> false
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @andreasisnes |
| Action | `workflow_dispatch` |
| Working Directory | `infra/deploy/spoke` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/yt01/spokes.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_yt01_spokes.tfstate.tfplan`